## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-04T22:24:57.155+0000" -> "2023-04-04T22:25:09.777+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-04T22:24:54.663+0000" -> "2023-04-04T22:25:07.217+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard will be created
+   resource "datadog_dashboard" "service_dashboard" {
+       dashboard_lists_removed = (known after apply)
+       description             = "Dashboard for monitoring the Grants Ingest pipeline service."
+       id                      = (known after apply)
+       is_read_only            = false
+       layout_type             = "ordered"
+       reflow_type             = "auto"
+       title                   = "Grants Ingest Service Dashboard (Draft - staging)"
+       url                     = (known after apply)

+       template_variable {
+           defaults = [
+               "production",
            ]
+           name     = "env"
+           prefix   = "env"
        }
+       template_variable {
+           available_values = [
+               "grants-ingest",
            ]
+           defaults         = [
+               "grants-ingest",
            ]
+           name             = "service"
+           prefix           = "service"
        }
+       template_variable {
+           defaults = [
+               "*",
            ]
+           name     = "version"
+           prefix   = "version"
        }

+       widget {
+           id = (known after apply)

+           group_definition {
+               layout_type = "ordered"
+               show_title  = true
+               title       = "DownloadGrantsGovDB"

+               widget {
+                   id = (known after apply)

+                   timeseries_definition {
+                       legend_columns = [
+                           "sum",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Invocation Status"

+                       request {
+                           display_type = "bars"

+                           formula {
+                               alias              = "Succeeded"
+                               formula_expression = "invoke_success"
                            }
+                           formula {
+                               alias              = "Failed"
+                               formula_expression = "invoke_failure"

+                               style {
+                                   palette       = "warm"
+                                   palette_index = 5
                                }
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_success"
+                                   query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:downloadgrantsgovdb}.as_count()"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_failure"
+                                   query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:downloadgrantsgovdb}.as_count()"
                                }
                            }
                        }
                    }
                }
+               widget {
+                   id = (known after apply)

+                   timeseries_definition {
+                       legend_columns = [
+                           "sum",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Invocation Duration"

+                       request {
+                           display_type = "line"

+                           formula {
+                               alias              = "Duration"
+                               formula_expression = "invoke_duration"
                            }
+                           formula {
+                               alias              = "Timeout"
+                               formula_expression = "invoke_timeout"

+                               style {
+                                   palette       = "warm"
+                                   palette_index = 5
                                }
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_duration"
+                                   query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:downloadgrantsgovdb}"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_timeout"
+                                   query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:downloadgrantsgovdb}"
                                }
                            }
                        }
                    }
                }
+               widget {
+                   id = (known after apply)

+                   timeseries_definition {
+                       legend_columns = [
+                           "value",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Source File Size"

+                       request {
+                           display_type = "line"

+                           formula {
+                               alias              = "Size"
+                               formula_expression = "size"
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "size"
+                                   query       = "avg:grants_ingest.DownloadGrantsGovDB.source_size{$env,$service,$version,handlername:downloadgrantsgovdb}"
                                }
                            }
                        }

+                       yaxis {
+                           include_zero = false
                        }
                    }
                }
            }
        }
+       widget {
+           id = (known after apply)

+           group_definition {
+               layout_type = "ordered"
+               show_title  = true
+               title       = "SplitGrantsGovXMLDB"

+               widget {
+                   id = (known after apply)

+                   timeseries_definition {
+                       legend_columns = [
+                           "sum",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Invocation Status"

+                       request {
+                           display_type = "bars"

+                           formula {
+                               alias              = "Succeeded"
+                               formula_expression = "invoke_success"
                            }
+                           formula {
+                               alias              = "Failed"
+                               formula_expression = "invoke_failure"

+                               style {
+                                   palette       = "warm"
+                                   palette_index = 5
                                }
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_success"
+                                   query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_failure"
+                                   query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()"
                                }
                            }
                        }
                    }
                }
+               widget {
+                   id = (known after apply)

+                   timeseries_definition {
+                       legend_columns = [
+                           "sum",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Invocation Duration"

+                       request {
+                           display_type = "line"

+                           formula {
+                               alias              = "Duration"
+                               formula_expression = "invoke_duration"
                            }
+                           formula {
+                               alias              = "Timeout"
+                               formula_expression = "invoke_timeout"

+                               style {
+                                   palette       = "warm"
+                                   palette_index = 5
                                }
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_duration"
+                                   query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:splitgrantsgovxmldb}"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_timeout"
+                                   query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:splitgrantsgovxmldb}"
                                }
                            }
                        }
                    }
                }
+               widget {
+                   id = (known after apply)

+                   timeseries_definition {
+                       legend_columns = [
+                           "sum",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Grant Opportunities Results"

+                       request {
+                           display_type = "bars"

+                           formula {
+                               alias              = "Skipped"
+                               formula_expression = "records_skipped"

+                               style {
+                                   palette       = "cool"
+                                   palette_index = 4
                                }
                            }
+                           formula {
+                               alias              = "Updated"
+                               formula_expression = "records_updated"

+                               style {
+                                   palette       = "purple"
+                                   palette_index = 4
                                }
                            }
+                           formula {
+                               alias              = "Created"
+                               formula_expression = "records_created"

+                               style {
+                                   palette       = "classic"
+                                   palette_index = 4
                                }
                            }
+                           formula {
+                               alias              = "Failed"
+                               formula_expression = "records_failed"

+                               style {
+                                   palette       = "warm"
+                                   palette_index = 5
                                }
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "records_skipped"
+                                   query       = "sum:grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "records_updated"
+                                   query       = "sum:grants_ingest.SplitGrantsGovXMLDB.opportunity.updated{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "records_created"
+                                   query       = "sum:grants_ingest.SplitGrantsGovXMLDB.opportunity.created{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "records_failed"
+                                   query       = "sum:grants_ingest.SplitGrantsGovXMLDB.opportunity.failed{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()"
                                }
                            }
                        }

+                       yaxis {
+                           include_zero = false
+                           scale        = "sqrt"
                        }
                    }
                }
            }
        }
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Size (in bytes) of the downloaded grants.gov database archive file."
+       id          = (known after apply)
+       metric      = "grants_ingest.DownloadGrantsGovDB.source_size"
+       per_unit    = "file"
+       short_name  = "Source file size in bytes"
+       unit        = "byte"
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of new grant opportunity records created during invocation."
+       id          = (known after apply)
+       metric      = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
+       short_name  = "New grant opportunities"
+       unit        = "record"
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of grant opportunity records that failed to process during invocation."
+       id          = (known after apply)
+       metric      = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
+       short_name  = "Failed grant opportunities"
+       unit        = "record"
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of unchanged grant opportunity records skipped during invocation."
+       id          = (known after apply)
+       metric      = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
+       short_name  = "Skipped grant opportunities"
+       unit        = "record"
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of modified grant opportunity records updated during invocation."
+       id          = (known after apply)
+       metric      = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
+       short_name  = "Updated grant opportunities"
+       unit        = "record"
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-04T22:25:09.777+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b470db5fc3cc4056a15845001891cd808bf73b15bea8a605683daf9d8cd58e76.zip" -> "builds/f9456777439881bd34abcc63d4fc4ca849bd69d2b4c3634c922dbd1a110d4ed9.zip"
      ~ s3_object_version              = "vtbvo7rdyFfoqHU00TwTUbccvW1R0BFA" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:4227c1cf0a13127229adac1b676623b20838f1e4,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:f228feb1a005cb4470d02f8430fb81409a59fda3,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "4227c1cf0a13127229adac1b676623b20838f1e4" -> "f228feb1a005cb4470d02f8430fb81409a59fda3"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "5" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2d2853c10f2fc275a832506cd897d4e8-2" -> (known after apply)
      ~ id                     = "builds/b470db5fc3cc4056a15845001891cd808bf73b15bea8a605683daf9d8cd58e76.zip" -> (known after apply)
      ~ key                    = "builds/b470db5fc3cc4056a15845001891cd808bf73b15bea8a605683daf9d8cd58e76.zip" -> "builds/f9456777439881bd34abcc63d4fc4ca849bd69d2b4c3634c922dbd1a110d4ed9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b470db5fc3cc4056a15845001891cd808bf73b15bea8a605683daf9d8cd58e76.zip" -> "builds/f9456777439881bd34abcc63d4fc4ca849bd69d2b4c3634c922dbd1a110d4ed9.zip"
-       tags                   = {} -> null
      ~ version_id             = "vtbvo7rdyFfoqHU00TwTUbccvW1R0BFA" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f9456777439881bd34abcc63d4fc4ca849bd69d2b4c3634c922dbd1a110d4ed9.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f9456777439881bd34abcc63d4fc4ca849bd69d2b4c3634c922dbd1a110d4ed9.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1010648902874406646" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b470db5fc3cc4056a15845001891cd808bf73b15bea8a605683daf9d8cd58e76.zip" -> "builds/f9456777439881bd34abcc63d4fc4ca849bd69d2b4c3634c922dbd1a110d4ed9.zip"
          ~ "timestamp" = "1680647072620122000" -> "1680648799228754000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5815734316106031454" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b470db5fc3cc4056a15845001891cd808bf73b15bea8a605683daf9d8cd58e76.zip" -> "builds/f9456777439881bd34abcc63d4fc4ca849bd69d2b4c3634c922dbd1a110d4ed9.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-04T22:25:07.217+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:4/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9cc6c6f51a5a1dd4598d752b42f44f5710e76eb659c5a68ea053757a2105849e.zip" -> "builds/aee5f77d641ca386105492deb6a766c38ddb82c1c8b928e37a80aec924e2ee20.zip"
      ~ s3_object_version              = "Rtb4k0ACo_OQ9BbAhffijBV4Qn1fbVt4" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:4227c1cf0a13127229adac1b676623b20838f1e4,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:f228feb1a005cb4470d02f8430fb81409a59fda3,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "4227c1cf0a13127229adac1b676623b20838f1e4" -> "f228feb1a005cb4470d02f8430fb81409a59fda3"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "4" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b229419cb9cc2289303f2dd085fde4f1-2" -> (known after apply)
      ~ id                     = "builds/9cc6c6f51a5a1dd4598d752b42f44f5710e76eb659c5a68ea053757a2105849e.zip" -> (known after apply)
      ~ key                    = "builds/9cc6c6f51a5a1dd4598d752b42f44f5710e76eb659c5a68ea053757a2105849e.zip" -> "builds/aee5f77d641ca386105492deb6a766c38ddb82c1c8b928e37a80aec924e2ee20.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9cc6c6f51a5a1dd4598d752b42f44f5710e76eb659c5a68ea053757a2105849e.zip" -> "builds/aee5f77d641ca386105492deb6a766c38ddb82c1c8b928e37a80aec924e2ee20.zip"
-       tags                   = {} -> null
      ~ version_id             = "Rtb4k0ACo_OQ9BbAhffijBV4Qn1fbVt4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/aee5f77d641ca386105492deb6a766c38ddb82c1c8b928e37a80aec924e2ee20.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/aee5f77d641ca386105492deb6a766c38ddb82c1c8b928e37a80aec924e2ee20.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5603566578308042817" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9cc6c6f51a5a1dd4598d752b42f44f5710e76eb659c5a68ea053757a2105849e.zip" -> "builds/aee5f77d641ca386105492deb6a766c38ddb82c1c8b928e37a80aec924e2ee20.zip"
          ~ "timestamp" = "1680647072546103000" -> "1680648799049609800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5463909789968168334" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9cc6c6f51a5a1dd4598d752b42f44f5710e76eb659c5a68ea053757a2105849e.zip" -> "builds/aee5f77d641ca386105492deb6a766c38ddb82c1c8b928e37a80aec924e2ee20.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 16 to add, 2 to change, 8 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4613041927)*